<?xml version="1.0" encoding="UTF-8"?>

<!-- This is an automatically generated file. -->
<Chapter Label="Chapter_Self-replicating_groups">
<Heading>Self-replicating groups</Heading>

 Introductory text. To do.
<Section Label="Chapter_Self-replicating_groups_Section_Properties_and_Attributes">
<Heading>Properties and Attributes</Heading>

<ManSection>
  <Prop Arg="G" Name="IsSelfReplicating" Label="for IsRegularRootedTreeGroup"/>
 <Returns> <K>true</K> if <A>G</A> is self-replicating, and <K>false</K> otherwise.
 
 
</Returns>
 <Description>
 The argument of this property is aa regular rooted tree group <A>G</A>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> subgroups:=AllSubgroups(AutT(2,2));
[ Group(()), Group([ (3,4) ]), Group([ (1,2) ]), Group([ (1,2)(3,4) ]), 
  Group([ (1,3)(2,4) ]), Group([ (1,4)(2,3) ]), Group([ (3,4), (1,2) ]), 
  Group([ (1,3)(2,4), (1,2)(3,4) ]), Group([ (1,3,2,4), (1,2)(3,4) ]), 
  Group([ (3,4), (1,2), (1,3)(2,4) ]) ]
gap> Apply(subgroups,G->RegularRootedTreeGroup(2,2,G));
gap> Apply(subgroups,G->IsSelfReplicating(G));
gap> subgroups;
[ false, false, false, false, false, false, false, true, true, true ]
]]></Example>


<ManSection>
  <Prop Arg="G" Name="HasSufficientRigidAutomorphisms" Label="for IsRegularRootedTreeGroup"/>
 <Returns> <K>true</K> if <A>G</A> has sufficient rigid automorphisms, and <K>false</K> otherwise.
 
 
</Returns>
 <Description>
 The argument of this property is a regular rooted tree group <A>G</A>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> subgroups:=AllSubgroups(AutT(2,2));
[ Group(()), Group([ (3,4) ]), Group([ (1,2) ]), Group([ (1,2)(3,4) ]), 
  Group([ (1,3)(2,4) ]), Group([ (1,4)(2,3) ]), Group([ (3,4), (1,2) ]), 
  Group([ (1,3)(2,4), (1,2)(3,4) ]), Group([ (1,3,2,4), (1,2)(3,4) ]), 
  Group([ (3,4), (1,2), (1,3)(2,4) ]) ]
gap> Apply(subgroups,G->RegularRootedTreeGroup(2,2,G));
gap> Apply(subgroups,G->HasSufficientRigidAutomorphisms(G));
gap> subgroups;
[ false, false, false, false, true, false, false, true, true, true ]
]]></Example>


<ManSection>
  <Attr Arg="G" Name="ParentGroup" Label="for IsRegularRootedTreeGroup"/>
 <Returns> The restriction of <A>G</A> to <Math>\mathrm{Aut}(T_{k,n-1})</Math>.
 
 
</Returns>
 <Description>
 The argument of this attribute is a regular rooted tree group <A>G</A> <Math>\le\mathrm{Aut}(T_{k,n})</Math>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> G:=AutT(2,3);;
gap> ParentGroup(G);
Group([ (1,2), (1,3)(2,4), (3,4) ])
gap> last=AutT(2,2);
true
]]></Example>


<ManSection>
  <Attr Arg="G" Name="MaximalExtension" Label="for IsRegularRootedTreeGroup"/>
 <Returns> The maximal extension of <Math>M(G)\le\mathrm{Aut}(T_{k,n+1})</Math> of <A>G</A>.
 
 
</Returns>
 <Description>
 The argument of this attribute is a self-replicating regular rooted tree group <A>G</A> <Math>\le\mathrm{Aut}(T_{k,n})</Math> with sufficient rigid automorphisms.
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> G:=AutT(2,3);;
gap> MaximalExtension(G);
<permutation group with 11 generators>
gap> last=AutT(2,4);
true
]]></Example>


<ManSection>
  <Attr Arg="G" Name="RepresentativeWithSufficientRigidAutomorphisms" Label="for IsRegularRootedTreeGroup"/>
 <Returns> A self-replicating <Math>\mathrm{Aut}(T_{k,n})</Math>-conjugate of <A>G</A> with sufficient rigid automorphisms. If <A>G</A> has sufficient rigid automorphisms then the output group has the same parent group (see <Ref Attr="ParentGroup"/>) as <A>G</A>.
 
 
</Returns>
 <Description>
 The argument of this attribute is a self-replicating regular rooted tree group <A>G</A> <Math>\le\mathrm{Aut}(T_{k,n})</Math>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> G:=SRGroup(2,3,6);
SRGroup(2,3,6)
gap> conjugates:=ShallowCopy(AsList(G^AutT(2,3)));
[ Group([ (1,5)(2,6)(3,7)(4,8), (1,3)(2,4)(5,7)(6,8), (1,2)(3,4) ]), 
  Group([ (1,5)(2,6)(3,8)(4,7), (1,3)(2,4)(5,8)(6,7), (1,2)(3,4) ]) ]
gap> Apply(conjugates,H->RegularRootedTreeGroup(2,3,H));
gap> for H in conjugates do Print(HasSufficientRigidAutomorphisms(H),"\n"); od;
true
false
gap> H:=conjugates[2];
Group([ (1,5)(2,6)(3,8)(4,7), (1,3)(2,4)(5,8)(6,7), (1,2)(3,4) ])
gap> IsSelfReplicating(H);
true
gap> RepresentativeWithSufficientRigidAutomorphisms(H);
Group([ (1,5)(2,6)(3,7)(4,8), (1,3)(2,4)(5,7)(6,8), (1,2)(3,4) ])
gap> last=conjugates[1];
true
]]></Example>


</Section>


<Section Label="Chapter_Self-replicating_groups_Section_Examples">
<Heading>Examples</Heading>

 AutT. More to come. Grigorchuk, Hanoi, ...
<ManSection>
  <Func Arg="k,n" Name="AutT" />
 <Returns> The regular rooted tree group <Math>\mathrm{Aut}(T_{k,n})</Math> as a permutation group of the <Math>k^{n}</Math> leaves of <Math>T_{k,n}</Math>.
 
</Returns>
 <Description>
 The arguments of this function are a degree <A>k</A> <Math>\in\mathbb{N}_{\ge 2}</Math> and a depth <A>n</A> <Math>\in\mathbb{N}</Math>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> G:=AutT(2,2);
Group([ (1,2), (3,4), (1,3)(2,4) ])
gap> Size(G);
8
]]></Example>


<ManSection>
  <Func Arg="G" Name="ConjugacyClassRepsMaxSelfReplicatingSubgroups" />
 <Returns> A list containing conjugacy class representatives of all maximal self-replicating subgroups of <A>G</A>.
 
</Returns>
 <Description>
 The argument of this function is any regular rooted tree group, <A>G</A>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> ConjugacyClassRepsMaxSelfReplicatingSubgroups(AutT(2,2));
[ Group([ (1,3)(2,4), (1,2)(3,4) ]), Group([ (1,3,2,4), (1,2)(3,4) ]) ]
]]></Example>


<ManSection>
  <Func Arg="G" Name="ConjugacyClassRepsSelfReplicatingSubgroupsWithConjugateProjection" />
 <Returns> A list containing conjugacy class representatives of all self-replicating subgroups of the maximal extension of <A>G</A>, <A>M(G)</A>.
 
</Returns>
 <Description>
 The argument of this function is any regular rooted tree group, <A>G</A>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> ConjugacyClassRepsSelfReplicatingSubgroupsWithConjugateProjection(AutT(3,1));
[ Group([ (1,4,7)(2,5,8)(3,6,9), (1,4)(2,5)(3,6), (1,2,3), (1,2) ]),
  Group([ (4,7)(5,8)(6,9), (1,4,7)(2,5,8)(3,6,9), (5,6)(8,9), (2,3)
      (8,9), (7,9,8), (4,6,5), (1,3,2) ]),
  Group([ (2,3)(4,7)(5,9)(6,8), (1,4,7)(2,5,8)(3,6,9), (5,6)(8,9),
      (2,3)(8,9), (7,9,8), (4,6,5), (1,3,2) ]),
  Group([ (2,3)(5,6)(8,9), (4,7)(5,8)(6,9), (1,4,7)(2,5,8)(3,6,9),
      (7,9,8), (4,6,5), (1,3,2) ]),
  Group([ (1,7)(2,8)(3,9)(5,6), (1,7,4)(2,9,5)(3,8,6), (1,2,3),
      (7,8,9), (4,6,5)(7,8,9) ]),
  Group([ (2,3)(4,7)(5,8)(6,9), (4,6,5)(7,9,8), (1,4,7)(2,5,9)
      (3,6,8), (1,2,3)(4,5,6)(7,9,8) ]),
  Group([ (2,3)(4,7)(5,8)(6,9), (1,7,6,2,9,4,3,8,5), (1,2,3)
      (4,6,5), (1,2,3)(4,5,6)(7,9,8) ]),
  Group([ (2,3)(4,7)(5,8)(6,9), (1,6,7,3,5,8,2,4,9), (1,3,2)(4,6,5)
      (7,8,9) ]),
  Group([ (2,3)(4,7)(5,8)(6,9), (1,7,4)(2,9,5)(3,8,6), (1,2,3)
      (4,5,6)(7,9,8) ]),
  Group([ (1,4)(2,5)(3,6), (1,7,4)(2,8,5)(3,9,6), (2,3)(5,6)(8,9),
      (1,2,3)(4,5,6)(7,8,9), (4,5,6)(7,9,8) ]),
  Group([ (2,3)(5,6)(8,9), (4,7)(5,8)(6,9), (1,4,7)(2,5,8)(3,6,9),
      (1,3,2)(4,6,5)(7,9,8) ]) ]
]]></Example>


</Section>


</Chapter>

